[
    {
        "image": "/portfolio.gif",
        "title":"Portfolio",
        "link": "https://elisacodes.com/", 
        "usedSkill":
        [
            "next.js", "tailwind", "javascript"
        ], 
        "usedTool":
        [
            "figma", "github"
        ],
        "team":["myself"], 
        "desc": "Elisacodes portfolio was built with Next.js due to its increasing popularity. The portfolio serves as a great introduction to React coding standards and best practices. Furthermore, a local JSON file allows for easy customization of the portfolio's content.", 
        "designDesc": "Firstly, a content plan was created to facilitate the creation of an initial wireframe and then a high-fidelity wireframe. \n \nThen it was development time. Given the time limit, there are many things I would like to change, including cleaning up the code and adding more animation.\n \nColours were chosen based on their meanings. The main pages are green to promote growth and learning, while the contact page is blue to induce feelings of trust and loyalty.",    
        "highlights":
           [ 
            {
                "highlightImg": "/portfolio-responsive.gif", 
                "highlightDesc": "Responsive page between mobile and desktop"
            },
            {
                "highlightImg":"/portfolio.gif",
                "highlightDesc":"Animated homepage to draw attention"
            }
        ]
         ,
        "learnedDesc": "It was challenging to determine what I truly wanted to code. I encountered difficulties transitioning from working with local JSON to utilizing a headless CMS and calling APIs. I realized that a detailed development plan, outlining the information retrieval process and the functions to be used, would have greatly enhanced organization. As I continued working on the project, I made a conscious effort to take notes on the React functions I encountered, as there were many that I didn't fully comprehend or understand their purpose. Moreover, this was my first experience with Next.js, and I discovered that Next.js has its own versions of various React packages. Additionally, coding with Tailwind CSS for the first time proved challenging, as it required careful organization due to its nature of code placement. Nonetheless, I acknowledge its growing popularity owing to its ability to facilitate quicker coding. However, a solid understanding of CSS is necessary to fully utilize Tailwind CSS."
     }, 

     {
         "image": "/capstone-main.gif",
         "title": "Artist Portfolio", 
         "link": "https://artist.bcitwebdeveloper.ca/",
         "usedSkill":
         [
           "WooCommerce", "Wordpress", "PHP" 
        ], 
        "usedTool":
        [
            "figma", "github"
        ],
        "team":["myself","henry","peter","len"],
        "desc": "This website is designed to target artists who would like to showcase and sell their artwork on the same site. It is built using a headless CMS with WordPress and integrated with WooCommerce.", 
        "designDesc":"Working with a group required an organized procedure.\n \n First, we created low-fidelity wireframes and an information architecture to ensure clarity on how the site would look. We then chose our main/secondary colours to style the website.\n \n Then, a brand new WordPress theme was developed by altering the PHP templates to bring the site to life.", 
        "highlights":
        [ 
            {
             "highlightImg": "/capstone-products.gif", 
             "highlightDesc": "Ability to add new product made from WordPress CPT"
         },
         {
             "highlightImg":"/capstone-gallery.gif",
             "highlightDesc":"Gallery of products that is a showcase for portfolio or sale"
         }
        ],
        "learnedDesc": "This project helped me realize the significance of having a well-thought-out plan for effective communication with my group mates, especially considering the scale of the project involving four people. It made me recognize that a plan can become confusing if not thoroughly explained to the group, leading to confusion for everyone involved.\n \n However, BCIT prepared me for this by supervising our group and ensuring that we stayed consistent with our initial plan, fostering an organized approach to completing the site."
     },
    
     {
        "image": "/bingewatch.gif",
        "title": "BingeWatch", 
        "link": "https://moviedb.elisacodes.com/",
        "usedSkill":
        [
            "react API", "sass", "javascript"
        ], 
        "usedTool":
        [
            "figma", "github"
        ],
        "team":["myself", "henry"],
        "desc": "Website is built entirely on React, and it uses the TMDB API to ensure that movie enthusiasts are always up-to-date with the latest releases and information about upcoming films.", 
        "designDesc": "Planning this website was a step-by-step process facilitated by BCIT's program, which involved creating a low-fidelity wireframe, followed by a high-fidelity wireframe, and ultimately a prototype.", 
        "highlights":
        [ 
         {
             "highlightImg": "/responsive-bingewatch.gif", 
             "highlightDesc": "Responsive page between mobile and desktop with interactive tabs"
         },
         {
             "highlightImg":"/favourite-bingewatch.gif",
             "highlightDesc":"Function to favourite or unfavourite movies into local storage"
         }
     ],
        "learnedDesc": "Developing this website was my first experience working with React, and due to the sheer number of API calls required to gather and display the necessary data, I had to create several helper functions to streamline the process. These functions not only made it easier to call the APIs, but also led to a cleaner, more organized code structure. Overall, this project provided a great opportunity to learn and implement new techniques in web development, and I'm proud of the end result."
     }
     ]